# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}

#+latex: \newcommand{\mytitle}{Estudos de Caso com Matrizes}
#+latex: \mytitleslide

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* (#2) Teste

#+BEGIN_EXPORT latex
\begin{tiny}
\begin{bmatrix}
0 & 0 & -1 & 0 & 2 \\
-3 & 0 & 0 & 4 & 0 \\
0 & -5 & 0 & 0 & 0 \\
0 & 0 & 0 & 6 & 0 \\
0 & -7 & 0 & 6 & 8 \\
\end{bmatrix}\to
\begin{bmatrix}
-1 & 0 & 2 \\
 2 & 0 & 4 \\
-3 & 1 & 0 \\
 4 & 1 & 3 \\
-5 & 2 & 2 \\
 6 & 3 & 3 \\
-7 & 4 & 1 \\
 6 & 4 & 3 \\
 8 & 4 & 4 \\
\end{bmatrix}
\end{tiny}
#+END_EXPORT

Vejamos

#+latex: {\tiny

#+attr_latex: :options fontsize=\tiny
#+begin_src bash :results output :session :exports both :dir e
gcc a17-esparsa.c
echo "0 0 -1 0 2 -3 0 0 4 0 0 -5 0 0 0 0 0 0 6 0 0 -7 0 6 8" | ./a.out
#+END_SRC

#+RESULTS:
#+begin_example

Esparsa
 3  0  7  5  3 
 0  0  2  0  0 
 0  0  0  0  3 
 6  0  6  0  0 
 0  0  0  9  0 
Condensada
 3  0  0 
 7  0  2 
 5  0  3 
 3  0  4 
 2  1  2 
 3  2  4 
 6  3  0 
 6  3  2 
 9  4  3 
#+end_example

#+latex: }

